Documents/Renault_ОплатаСтраховогоПолиса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ОплатаСтраховогоПолиса</Name>
			<BasedOn>
				<xr:Item>Document.Renault_СтраховойПолис</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Renault_КвитанцииКПолисам</xr:Item>
				<xr:Item>InformationRegister.Renault_СтатусыБСО</xr:Item>
				<xr:Item>AccumulationRegister.Renault_ВзаиморасчетыСоСтрахователями</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_СтраховойПолис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтраховойПолис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_СтраховойПолис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетОрганизации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПлательщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезКвитанции</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаСК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаЧерезБанк</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеализацияТоваров</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Renault_ВзаиморасчетыСоСтрахователями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>Renault_ВзаиморасчетыСоСтрахователями</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страхователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховойПолис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_СтраховойПолис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/Renault_КвитанцииКПолисам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_КвитанцииКПолисам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтраховойПолис</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_СтраховойПолис</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_СтатусыБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СтатусыБСО</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_СтатусыБСО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтраховаяКомпания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ТипыБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияБСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СерииБСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерБСО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_СтатусыБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СтатусыБСО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятИзСК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданНаТочку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испорчен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Чистый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/Renault_СтатусыСтраховыхПолисов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_СтатусыСтраховыхПолисов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Испорчен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_ОплатаСтраховогоПолиса/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка) Экспорт
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Renault_СтраховойПолис") Тогда
		// Заполнение шапки
		Агент = ДанныеЗаполнения.Агент;
		Банк = ДанныеЗаполнения.Банк;
//		БанковскийСчетОрганизации = ДанныеЗаполнения.БанковскийСчетОрганизации;
		//ВалютаДокумента = ДанныеЗаполнения.ВалютаДокумента;
		//ВидОплаты = ДанныеЗаполнения.ВидОплаты;
		
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		ЗаказПокупателя = ДанныеЗаполнения.ЗаказПокупателя;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Контрагент = ДанныеЗаполнения.Контрагент;
		//КратностьВзаиморасчетов = ДанныеЗаполнения.КратностьВзаиморасчетов;
		//КурсВзаиморасчетов = ДанныеЗаполнения.КурсВзаиморасчетов;
		//НомерБСО = ДанныеЗаполнения.НомерБСО;
		Организация = ДанныеЗаполнения.Организация;
		Плательщик = ДанныеЗаполнения.Плательщик;
		
		ДоговорПлательщика = CRM_Сервер.DMS_ПолучитьОсновнойДоговорКонтрагента(Плательщик);//ДанныеЗаполнения.ДоговорПлательщика;
		
		
		//Подразделение = ДанныеЗаполнения.Подразделение;
		//Проект = ДанныеЗаполнения.Проект;
		//СерияБСО = ДанныеЗаполнения.СерияБСО;
		СтраховойПолис = ДанныеЗаполнения.Ссылка;
		СтавкаНДС =Справочники.СтавкиНДС.ОсновнаяСтавкаНДС; // ДанныеЗаполнения.СтавкаНДС;
		СуммаВключаетНДС = Истина;// ДанныеЗаполнения.СуммаВключаетНДС;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		//ТипБСО = ДанныеЗаполнения.ТипБСО;
		//ТипЦен = ДанныеЗаполнения.ТипЦен;
		ТочкаПродаж = ДанныеЗаполнения.ТочкаПродаж;
		//УсловиеПродаж = ДанныеЗаполнения.УсловиеПродаж;
		УчитыватьНДС = Истина; //ДанныеЗаполнения.УчитыватьНДС;
		//РеализацияТоваров=ДанныеЗаполнения.РеализацияТоваров;
		
		Запрос=Новый Запрос("Выбрать Первые 1 Ссылка Из Документ.РеализацияТоваров Где ДокументОснование=&Заказ");
		Запрос.УстановитьПараметр("Заказ",ЗаказПокупателя);
		Выборка=Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		РеализацияТоваров=Выборка.Ссылка;
		
		Запрос=Новый Запрос;
		Запрос.УстановитьПараметр("Заказ",ЗаказПокупателя);
		Запрос.УстановитьПараметр("РеализацияТоваров",РеализацияТоваров);
		Запрос.Текст="
		|Выбрать Первые 1 Ссылка Из Документ.ПриходныйКассовыйОрдер Где ДокументОснование В(&РеализацияТоваров,&Заказ)
		|Объединить
		|Выбрать Первые 1 Ссылка Из Документ.ПлатежноеПоручение Где ДокументОснование В(&РеализацияТоваров,&Заказ)
		|Объединить
		|Выбрать Первые 1 Ссылка Из Документ.ЧекНаОплату Где ДокументОснование В(&РеализацияТоваров,&Заказ)
		|";
		Выборка=Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		ПлатежныйДокумент=Выборка.Ссылка;
		
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Renault_ВзаиморасчетыСоСтрахователями Приход
	Движения.Renault_ВзаиморасчетыСоСтрахователями.Записывать = Истина;
	Движения.Renault_ВзаиморасчетыСоСтрахователями.Очистить();
	Движение = Движения.Renault_ВзаиморасчетыСоСтрахователями.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Страхователь = Контрагент;
	Движение.СтраховойПолис = СтраховойПолис;
	Движение.Сумма = СуммаДокумента;

	Движения.Renault_КвитанцииКПолисам.Записывать = Истина;
	Движения.Renault_КвитанцииКПолисам.Очистить();
	
	Движения.Renault_СтатусыБСО.Записывать = Истина;
	Движения.Renault_СтатусыБСО.Очистить();
	
	Если НЕ БезКвитанции Тогда
		// регистр Renault_КвитанцииКПолисам
		Движение = Движения.Renault_КвитанцииКПолисам.Добавить();
		Движение.СтраховаяКомпания = СтраховойПолис.СтраховаяКомпания;
		Движение.ТипБСО = ТипБСО;
		Движение.СерияБСО = СерияБСО;
		Движение.НомерБСО = НомерБСО;
		Движение.СтраховойПолис = СтраховойПолис;
		
		// регистр Renault_СтатусыБСО
		Движение = Движения.Renault_СтатусыБСО.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.СтраховаяКомпания = СтраховойПолис.СтраховаяКомпания;
		Движение.ТипБСО = ТипБСО;
		Движение.СерияБСО = СерияБСО;
		Движение.НомерБСО = НомерБСО;
		Движение.Статус = Перечисления.Renault_СтатусыБСО.Продан;
		
	КонецЕсли;	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПечатьНаправленияВКассу() Экспорт
	
	Если НЕ Проведен Тогда
		Сообщить("Направление может быть распечатано только после проведения документа");	
		Возврат;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("НаправлениеВКассу");	
    Область = Макет.ПолучитьОбласть("Направление");
	Область.Параметры.Заголовок = "Направление в кассу № " + Ссылка.Номер;
	Область.Параметры.НомерПолиса = "" + СокрЛП(СтраховойПолис.СерияБСО) + " " + СокрЛП(СтраховойПолис.НомерБСО);
	Область.Параметры.ДатаЗаключения = СтраховойПолис.Дата;
	Область.Параметры.Дата = ДатаОплаты;
	Область.Параметры.СтраховаяКомпания = СтраховойПолис.СтраховаяКомпания;
	Область.Параметры.Сумма = "" + Цел(СуммаДокумента) + " руб. " + Прав(Формат(СуммаДокумента, "ЧДЦ=2"), 2) + " коп.";
	Область.Параметры.Агент = Агент;
	Область.Параметры.Контрагент = Контрагент;
	
	ТабДок.Вывести(Область);
	
	ТабДок.Показать();

КонецПроцедуры

//ПАЦ Тишин 24.10.2015 +++
Процедура ПечатьКвитанции() Экспорт
	
	Если НЕ Проведен Тогда
		Сообщить("Квитанция может быть распечатана только после проведения документа");	
		Возврат;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("Квитанция");	
    Область = Макет.ПолучитьОбласть("Квитанция");
	
	//ПредставлениеОрганизации = ПолучитьПредставлениеКонтрагента(Организация);
	
	Область.Параметры.НомерНаправления = Номер;
	Область.Параметры.СтраховаяКомпания = СтраховойПолис.СтраховаяКомпания.НаименованиеПолное;
	Область.Параметры.Страхователь = Плательщик;
	Область.Параметры.НомерПолиса = "" + СокрЛП(СтраховойПолис.СерияБСО) + " " + СокрЛП(СтраховойПолис.НомерБСО);
	Область.Параметры.ВидСтрахования = СтраховойПолис.ВидСтрахования;
	Область.Параметры.Организация = Организация.Наименование;
	//Область.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;
	Область.Параметры.Агент = Агент;
	Область.Параметры.Сумма = СуммаДокумента;
	Область.Параметры.СуммаПрописью = Renault_Advanced_ОбщегоНазначения.СформироватьСуммуПрописью(СуммаДокумента, ВалютаДокумента);
	Область.Параметры.Дата = Формат(ДатаОплаты, "ДЛФ=Д");
	
	ТабДок.Вывести(Область);
	
	ТабДок.ПолеСверху = 0;
    ТабДок.ПолеСнизу  = 0;
	
	ТабДок.Показать();

КонецПроцедуры 
//ПАЦ Тишин 24.10.2015 ---

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//Временное отключение проверки
	//Возврат;
	
	Если ЭтотОбъект.ОбменДанными.Загрузка ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Если НЕ ЗначениеЗаполнено(ДокументОснование) Тогда
			Сообщить("Оплата должна быть введена на основании страхового полиса!");	
		КонецЕсли;	
		
		Если СтраховойПолис.ОплатаСК Тогда
			Сообщить("Для прямой оплаты страховой компании ввод документов оплаты не требуется!");
			Отказ = истина;
		КонецЕсли;
		
		Если СтраховойПолис.Состояние <> Перечисления.Renault_СтатусыСтраховыхПолисов.ВРаботе И СтраховойПолис.Состояние <> Перечисления.Renault_СтатусыСтраховыхПолисов.Продан Тогда
			Сообщить("Для оплаты полиса установите статус ""В работе"" или ""Продан""!");
			Отказ = истина;
		КонецЕсли;	
		
		Если НЕ БезКвитанции Тогда
			Если НЕ ЗначениеЗаполнено(ТипБСО) Тогда
				Сообщить("Необходимо заполнить тип БСО!");
				Отказ = Истина;
			КонецЕсли;
			//Если НЕ ЗначениеЗаполнено(СерияБСО) Тогда
			//	Сообщить("Необходимо заполнить серию БСО!");
			//	Отказ = Истина;
			//КонецЕсли;
			Если НЕ ЗначениеЗаполнено(НомерБСО) Тогда
				Сообщить("Необходимо заполнить номер БСО!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;	
		
		ТаблицаБСО = Renault_УчетБСО.ПолучитьПустуюТаблицуБСО();
		НоваяСтрока = ТаблицаБСО.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭтотОбъект);
		НоваяСтрока.СтраховаяКомпания = СтраховойПолис.СтраховаяКомпания;
		НоваяСтрока.Количество = 1;
		
		Если НЕ БезКвитанции Тогда
			ЕстьБСОНаТочке = Renault_УчетБСО.ПроверитьНаличиеБСО(Дата, ТаблицаБСО, Организация, СтраховойПолис.СтраховаяКомпания, ТочкаПродаж, истина);
			Если НЕ ЕстьБСОНаТочке Тогда
				Отказ = истина;	
			КонецЕсли;	
		
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("СтраховаяКомпания", СтраховойПолис.СтраховаяКомпания);
			Запрос.УстановитьПараметр("ТипБСО", ТипБСО);
			Запрос.УстановитьПараметр("СерияБСО", СерияБСО);
			Запрос.УстановитьПараметр("НомерБСО", НомерБСО);
			Запрос.Текст = "ВЫБРАТЬ
			               |	Renault_КвитанцииКПолисам.СтраховойПолис,
			               |	Renault_КвитанцииКПолисам.СтраховаяКомпания,
			               |	Renault_КвитанцииКПолисам.ТипБСО,
			               |	Renault_КвитанцииКПолисам.СерияБСО,
			               |	Renault_КвитанцииКПолисам.НомерБСО
			               |ИЗ
			               |	РегистрСведений.Renault_КвитанцииКПолисам КАК Renault_КвитанцииКПолисам
			               |ГДЕ
			               |	Renault_КвитанцииКПолисам.ТипБСО = &ТипБСО
			               |	И Renault_КвитанцииКПолисам.СтраховаяКомпания = &СтраховаяКомпания
			               |	И Renault_КвитанцииКПолисам.СерияБСО = &СерияБСО
			               |	И Renault_КвитанцииКПолисам.НомерБСО = &НомерБСО";
						   
			Если НЕ ЭтоНовый() Тогда
				Запрос.Текст = Запрос.Текст + "
				               |	И Renault_КвитанцииКПолисам.Регистратор <> &Ссылка";
				Запрос.УстановитьПараметр("Ссылка", Ссылка);			   
			КонецЕсли;				   
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				Сообщить("Квитанция " + СокрЛП(Выборка.ТипБСО) + " " + СокрЛП(Выборка.СерияБСО) + " " + СокрЛП(Выборка.НомерБСО) + " уже введена для полиса " + Выборка.СтраховойПолис);
				Отказ = истина;
			КонецЦикла;	
		КонецЕсли;
		
		Если СтраховойПолис.ОплатаСК ИЛИ СтраховойПолис.ОплатаЧерезБанк Тогда
			Сообщить("Нельзя ввести документ оплаты, если указано, что весь полис оплачен через страховую или банк");
			Отказ = истина;
		КонецЕсли;	
		
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Если ЗначениеЗаполнено(ПлатежныйДокумент) Тогда
			Сообщить("Нельзя отменять проведение документа, если на кассе введен платежный документ");
			Отказ = истина;
		КонецЕсли;	
		
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если НЕ ЗначениеЗаполнено(ДокументОснование) 
			//ИЛИ ЗаказПокупателя = Документы.ЗаказПокупателя.ПустаяСсылка() 
			//ИЛИ НЕ ЗначениеЗаполнено(ЗаказПокупателя) 
			ИЛИ ЗаказПокупателя <> ДокументОснование.ЗаказПокупателя 
			ИЛИ (ДокументОснование.Состояние <> Перечисления.Renault_СтатусыСтраховыхПолисов.ВРаботе 
			И ДокументОснование.Состояние <> Перечисления.Renault_СтатусыСтраховыхПолисов.Продан) 
			ИЛИ НЕ ДокументОснование.Проведен Тогда
			Сообщить("Полис был изменен, либо не проведен, либо не установлен статус ""В работе"" или ""Продан""");
			Сообщить("Если полис не проведен или имеет другой статус, то установите статус, перепроведите полис и заново введите оплату");
			Сообщить("Если статус полиса верный и он проведен, то введите новый документ ""Оплата страхового полиса""");
			Сообщить("Если документ ""Оплата страхового полиса"" открыт, то закройте его без сохранения и введите заново");
			Отказ = истина;
		КонецЕсли;	
		
	КонецЕсли;
	
	
КонецПроцедуры

Функция ПолучитьПредставлениеКонтрагента(ТекущийКонтрагент)
	
	Представление = "";

	ЭтоЮрЛицо = ТекущийКонтрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ЮрЛицо;
	
	ДанныеКонтрагента = ?(ЭтоЮрЛицо, Renault_ОбщегоНазначения.ПолучитьДанныеЮрЛица(ТекущийКонтрагент), Renault_ОбщегоНазначения.ПолучитьДанныеФизЛица(ТекущийКонтрагент));
	
	Если ЭтоЮрЛицо Тогда
		ДобавитьТекстКПредставлению(Представление, ДанныеКонтрагента.НаименованиеПолное, ", ", "");
		ДобавитьТекстКПредставлению(Представление, ДанныеКонтрагента.ИНН,                ", ", "ИНН/КПП ");
		ДобавитьТекстКПредставлению(Представление, ДанныеКонтрагента.КПП,                "/",  "");
		ДобавитьТекстКПредставлению(Представление, ДанныеКонтрагента.АдресОсновной,      ", ", "");
		ДобавитьТекстКПредставлению(Представление, ДанныеКонтрагента.ТелефонОсновной,    ", ", "тел.: ");
		ДобавитьТекстКПредставлению(Представление, ДанныеКонтрагента.НомерСчета,         ", ", "р/с ");
		ДобавитьТекстКПредставлению(Представление, ДанныеКонтрагента.БанкНаименование,   ", ", "в банке ");
		ДобавитьТекстКПредставлению(Представление, ДанныеКонтрагента.БанкБИК,            ", ", "БИК ");
		ДобавитьТекстКПредставлению(Представление, ДанныеКонтрагента.БанкКоррСчет,       ", ", "к/с ");
	Иначе
		ДобавитьТекстКПредставлению(Представление, ДанныеКонтрагента.ПолноеФИО,          ", ", "");
		ДобавитьТекстКПредставлению(Представление, ДанныеКонтрагента.АдресОсновной,      ", ", "");
		ДобавитьТекстКПредставлению(Представление, ДанныеКонтрагента.ТелефонОсновной,    ", ", "тел.: ");
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Процедура ДобавитьТекстКПредставлению(ТекущиеПредставление, Знач ТекущийТекст, Разделитель = ",", НачалоТекста ="", КонецТекста = "")
	
	ТекущийТекст      = СокрЛП(ТекущийТекст);
	ДобавитьРазделить = НЕ ПустаяСтрока(ТекущиеПредставление) И Прав(ТекущиеПредставление, СтрДлина(Разделитель)) <> Разделитель И НЕ ПустаяСтрока(ТекущийТекст);
	Если НЕ ПустаяСтрока(ТекущийТекст) Тогда
		ТекущиеПредставление = ТекущиеПредставление + ?(ДобавитьРазделить, Разделитель, "") + НачалоТекста + ТекущийТекст + КонецТекста;
	КонецЕсли;
	
КонецПроцедуры
